# Demo Pandas

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s1 = pd.Series([1,2,3,4])
print(s1)
print(type(s1))

0    1
1    2
2    3
3    4
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
s2 = pd.Series({'apple':1,'mango':20,'grapes':78})
print(s2)

apple      1
mango     20
grapes    78
dtype: int64

In [20]:
d1 = pd.DataFrame({"fruits":['grapes','mango','apple','papaya'],
                   "stock": [20,40,78,None]})
print(d1)

   fruits  stock
0  grapes   20.0
1   mango   40.0
2   apple   78.0
3  papaya    NaN

In [6]:
d1.dtypes

fruits    object
stock      int64
dtype: object

In [8]:
df = pd.read_csv(r'C:\Users\VishwasKSingh\Workspace\temp\my_app\data\events.csv')

In [9]:
df.head()

,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
0,E001,Python OOP,Bengaluru,50,2026-01-13 10:00,I001
1,E002,Data Wrangling,Bengaluru,30,2026-01-16 14:00,I001
2,E003,Python OOP,Bengaluru,40,2026-01-19 10:00,I003
3,E004,Python OOP,Mysuru,60,2026-01-22 10:00,I002
4,E005,Machine Learning Essentials,Bengaluru,40,2026-01-25 14:00,I002

In [10]:
df.head(2)

,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
0,E001,Python OOP,Bengaluru,50,2026-01-13 10:00,I001
1,E002,Data Wrangling,Bengaluru,30,2026-01-16 14:00,I001

In [11]:
df.tail()

,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
7,E008,Machine Learning Essentials,Bengaluru,60,2026-02-03 09:00,I002
8,E009,Python OOP,Hyderabad,50,2026-02-06 10:00,I003
9,E010,Python OOP,Bengaluru,40,2026-02-09 11:00,I001
10,E011,Data Wrangling,Bengaluru,60,2026-02-12 11:00,I002
11,E012,Machine Learning Essentials,Mysuru,50,2026-02-15 11:00,I001

In [12]:
df['event_id']

0     E001
1     E002
2     E003
3     E004
4     E005
5     E006
6     E007
7     E008
8     E009
9     E010
10    E011
11    E012
Name: event_id, dtype: object

In [14]:
df.loc[0,'event_id']

'E001'

In [16]:
df.iloc[0,0]

'E001'

In [18]:
df.describe()

       venue_capacity
count       12.000000
mean        45.833333
std         10.836247
min         30.000000
25%         40.000000
50%         45.000000
75%         52.500000
max         60.000000

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   event_id             12 non-null     object
 1   topic                12 non-null     object
 2   city                 12 non-null     object
 3   venue_capacity       12 non-null     int64
 4   scheduled_date_time  12 non-null     object
 5   instructor_id        12 non-null     object
dtypes: int64(1), object(5)
memory usage: 708.0+ bytes

In [21]:
d1.head()

   fruits  stock
0  grapes   20.0
1   mango   40.0
2   apple   78.0
3  papaya    NaN

In [22]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   fruits  4 non-null      object
 1   stock   3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 196.0+ bytes

In [23]:
d1['stock'].isna().sum()

np.int64(1)

In [26]:
df[(df['venue_capacity'] == 50) & (df['city'] == 'Bengaluru')]

,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
0,E001,Python OOP,Bengaluru,50,2026-01-13 10:00,I001

In [28]:
df.query("venue_capacity == 50 and city == 'Bengaluru'")

,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
0,E001,Python OOP,Bengaluru,50,2026-01-13 10:00,I001

In [31]:
import sqlite3
from sqlalchemy.orm import base
from sqlalchemy import create_engine

engine = create_engine("sqlite:///myfile.db")

with engine.connect() as conn:
    df.to_sql(name="events",con=conn,if_exists='replace')

In [32]:
with engine.connect() as conn:
    df1 = pd.read_sql('SELECT * FROM events', con=conn)

df1.head()

,index,event_id,topic,city,venue_capacity,scheduled_date_time,instructor_id
0,0,E001,Python OOP,Bengaluru,50,2026-01-13 10:00,I001
1,1,E002,Data Wrangling,Bengaluru,30,2026-01-16 14:00,I001
2,2,E003,Python OOP,Bengaluru,40,2026-01-19 10:00,I003
3,3,E004,Python OOP,Mysuru,60,2026-01-22 10:00,I002
4,4,E005,Machine Learning Essentials,Bengaluru,40,2026-01-25 14:00,I002